-*- mode:org; fill-column:70; coding:utf-8; -*-
#+STARTUP: overview customtime noalign logdone hidestars
#+AUTHOR: dennyzhang.com (denny@dennyzhang.com)
** Table: sum up a column 
|     Num | Item      |     Vote |
|---------+-----------+----------|
|       1 | Item1     |       11 |
|       2 | Item2     |        7 |
|       3 | Item3     |        4 |
|       4 | Item4     |        4 |
|       5 | Item5     |        5 |
|       6 | Not voted |        5 |
|---------+-----------+----------|
| Summary |           | sum = 36 |
#+TBLFM: $1=@-1$1+1;N::$LR1=Summary::$LR3=sum=(vsum(@2$3..@-1$3))
** Table: auto-increase column
| Num | Item                       | Comment                         |
|-----+----------------------------+---------------------------------|
|   1 | M-x locate-library         |                                 |
|   2 | M-x list-load-path-shadows | Debug conflicting installations |
|   3 | M-x find-library           |                                 |
#+TBLFM: $1=@-1$1+1;N
